IOsetting/at32f403a_407-template/Libraries/bsp/src/at32f403a_407_bsp_sdio.c
  if((card_type == SDIO_MULTIMEDIA_CARD) || (card_type == SDIO_HIGH_SPEED_MULTIMEDIA_CARD))
  {
    status = mmc_switch(EXT_CSD_CMD_SET_NORMAL, EXT_CSD_BUS_WIDTH, (uint8_t)mode);
  }
  else if((card_type == SDIO_STD_CAPACITY_SD_CARD_V1_1) || (card_type == SDIO_STD_CAPACITY_SD_CARD_V2_0) || \
          (card_type == SDIO_HIGH_CAPACITY_SD_CARD))
  {
    if(mode >= 2)
    {
      /* not support D8 mode */
      return SD_UNSUPPORTED_FEATURE;
    }

    if(SDIO_BUS_WIDTH_D4 == mode)
    {
      status = sd_bus_wide_enable(TRUE);
    }
    else
    {
      status = sd_bus_wide_enable(FALSE);
    }
  }

  if(status == SD_OK)
  {
    sdio_bus_width_config(SDIOx, mode);
  }

  return status;
}

/**
  * @brief  set sdio work mode.
  * @param  mode
  *         parameter as following values:
  *         - SD_TRANSFER_POLLING_MODE: dma mode.
  *         - SD_TRANSFER_POLLING_MODE: polling mode.
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type sd_device_mode_set(uint32_t mode)
{
  sd_error_status_type status = SD_OK;

  if((mode == SD_TRANSFER_DMA_MODE) || (mode == SD_TRANSFER_POLLING_MODE))
  {
    device_mode = (sd_data_transfer_mode_type)mode;
  }
  else
  {
    status = SD_INVALID_PARAMETER;
  }

  return status;
}

/**
  * @brief  selects od deselects the corresponding card.
  * @param  addr: address of the card to be selected.
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type sd_deselect_select(uint32_t addr)
{
  /* send cmd7, select card */
  sdio_command_init_struct.argument =  addr;
  sdio_command_init_struct.cmd_index = SD_CMD_SEL_DESEL_CARD;
  sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
  sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_INT;

  /* sdio command config */
  sdio_command_config(SDIOx, &sdio_command_init_struct);
  /* enable ccsm */
  sdio_command_state_machine_enable(SDIOx, TRUE);

  return command_rsp1_error(SD_CMD_SEL_DESEL_CARD);
}

/**
  * @brief  read data from or write data to sd card.
  * @param  sdio_cmd_init_struct: pointer to sdio_command_struct_type structure.
  * @param  sdio_data_init_struct: pointer to sdio_data_struct_type structure.
  * @param  buf: pointer to data buffer read or write.
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type sdio_command_data_send(sdio_command_struct_type *sdio_cmd_init_t, \
                                            sdio_data_struct_type* sdio_data_init_t, uint32_t *buf)
{
  sd_error_status_type status = SD_OK;
  uint32_t count = 0;
  uint32_t timeout = SDIO_DATATIMEOUT;
  uint32_t length = 0;

  if(buf == NULL)
  {
    return SD_INVALID_PARAMETER;
  }
  /* clear dtctrl register */
  SDIOx->dtcnt = 0x0;

  /* sdio command config */
  sdio_data_config(SDIOx, sdio_data_init_t);
  /* enable dcsm */
  sdio_data_state_machine_enable(SDIOx, TRUE);

  length = sdio_data_init_t->data_length;

  if(device_mode == SD_TRANSFER_DMA_MODE)
  {
    if(sdio_data_init_t->transfer_direction == SDIO_DATA_TRANSFER_TO_CONTROLLER)
    {
      sd_dma_config(buf, length, DMA_DIR_PERIPHERAL_TO_MEMORY);
      SDIOx->inten |= SDIO_INTR_STS_READ_MASK;
      transfer_error = SD_OK;
      transfer_end = 0;
      sdio_dma_enable(SDIOx, TRUE);
    }
  }

  /* sdio command config */
  sdio_command_config(SDIOx, sdio_cmd_init_t);
  /* enable ccsm */
  sdio_command_state_machine_enable(SDIOx, TRUE);

  status = command_rsp1_error(sdio_cmd_init_t->cmd_index);
  if(status != SD_OK)
  {
    return status;
  }

  /* polling mode */
  if(device_mode == SD_TRANSFER_POLLING_MODE)
  {
    if(SDIO_DATA_TRANSFER_TO_CONTROLLER == sdio_data_init_t->transfer_direction)
    {
      while(!(SDIOx->sts & (SDIO_INTR_STS_READ_MASK)))
      {
        if(sdio_flag_get(SDIOx, SDIO_RXBUFH_FLAG) != RESET)
        {
          for(count = 0; count < 8; count++, buf++)
          {
            *buf = sdio_data_read(SDIOx);
          }

          timeout = 0x7FFFFF;
        }
        else
        {
          if(0 == timeout)
          {
            sd_init();
            return SD_DATA_TIMEOUT;
          }

          timeout--;
        }
      }

      while(sdio_flag_get(SDIOx, SDIO_RXBUF_FLAG) != RESET)
      {
        *buf = sdio_data_read(SDIOx);
        buf++;
      }
    }
    else
    {
      while(!(SDIOx->sts & SDIO_INTR_STS_WRITE_MASK))
      {
        if(sdio_flag_get(SDIOx, SDIO_TXBUFH_FLAG) != RESET)
        {
          for(count = 0; count < 8 && length > 0; count++, buf++, length -= 4)
          {
            sdio_data_write(SDIOx, *buf);
          }

          timeout = 0x3FFFFFFF;
        }
        else
        {
          if(timeout == 0)
          {
            sd_init();
            return SD_DATA_TIMEOUT;
          }

          timeout--;
        }
      }
    }
    /* data timeout */
    if(sdio_flag_get(SDIOx, SDIO_DTTIMEOUT_FLAG) != RESET)
    {
      sdio_flag_clear(SDIOx, SDIO_DTTIMEOUT_FLAG);
      return SD_DATA_TIMEOUT;
    }
    /* crc error */
    else if(sdio_flag_get(SDIOx, SDIO_DTFAIL_FLAG) != RESET)
    {
      sdio_flag_clear(SDIOx, SDIO_DTFAIL_FLAG);
      return SD_DATA_FAIL;
    }
    /* over run error */
    else if(sdio_flag_get(SDIOx, SDIO_RXERRO_FLAG) != RESET)
    {
      sdio_flag_clear(SDIOx, SDIO_RXERRO_FLAG);
      return SD_RX_OVERRUN;
    }
    /* under run error */
    else if(sdio_flag_get(SDIOx, SDIO_TXERRU_FLAG) != RESET)
    {
      sdio_flag_clear(SDIOx, SDIO_TXERRU_FLAG);
      return SD_TX_UNDERRUN;
    }
    /* start bit error */
    else if(sdio_flag_get(SDIOx, SDIO_SBITERR_FLAG) != RESET)
    {
      sdio_flag_clear(SDIOx, SDIO_SBITERR_FLAG);
      return SD_START_BIT_ERR;
    }
    /* data transfer complete */
    if((stop_flag == 1) && (sdio_flag_get(SDIOx, SDIO_DTCMPL_FLAG) != RESET))
    {
      /* send cmd12, stop transmission */
      sdio_cmd_init_t->argument =  0;
      sdio_cmd_init_t->cmd_index = SD_CMD_STOP_TRANSMISSION;
      sdio_cmd_init_t->rsp_type = SDIO_RESPONSE_SHORT;
      sdio_cmd_init_t->wait_type = SDIO_WAIT_FOR_NO;

