IOsetting/at32f403a_407-template/Libraries/bsp/src/at32f403a_407_bsp_sdio.c
    /* sdio command config */
    sdio_command_config(SDIOx, &sdio_command_init_struct);
    /* enable ccsm */
    sdio_command_state_machine_enable(SDIOx, TRUE);

    status = command_rsp1_error(SD_CMD_SET_BLOCK_COUNT);

    if(status != SD_OK)
    {
      return status;
    }
  }

  /* send cmd25, write mult blocks */
  sdio_command_init_struct.argument = addr;
  sdio_command_init_struct.cmd_index = SD_CMD_WRITE_MULT_BLOCK;
  sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
  sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

  sdio_data_init_struct.block_size = (sdio_block_size_type)(power);
  sdio_data_init_struct.data_length = nblks * blk_size ;
  sdio_data_init_struct.timeout = SD_DATATIMEOUT ;
  sdio_data_init_struct.transfer_direction = SDIO_DATA_TRANSFER_TO_CARD;
  sdio_data_init_struct.transfer_mode = SDIO_DATA_BLOCK_TRANSFER;

  stop_flag = 1;
  /* cmd12 is needed */
  status = sdio_command_data_send(&sdio_command_init_struct, &sdio_data_init_struct, (uint32_t *)buf);

  if(status != SD_OK)
  {
    return status;
  }

  sdio_flag_clear(SDIOx, SDIO_STATIC_FLAGS);

  status = check_card_programming(&card_state);

  while((status == SD_OK) && ((card_state == SD_CARD_PROGRAMMING) || (card_state == SD_CARD_RECEIVING)))
  {
    status = check_card_programming(&card_state);
  }

  return status;
}

/**
  * @brief  read mmc card data stream.
  * @param  buf: buffer of saving data from mmc card
  * @param  addr: start address of data from mmc card
  * @param  len: data size
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type mmc_stream_read(uint8_t *buf, long long addr, uint32_t len)
{
  uint32_t response = 0;

  SDIOx->dtctrl = 0x0;

  /* clear dcsm configuration */
  sdio_data_init_struct.block_size = SDIO_DATA_BLOCK_SIZE_1B;
  sdio_data_init_struct.data_length = 0 ;
  sdio_data_init_struct.timeout = SD_DATATIMEOUT ;
  sdio_data_init_struct.transfer_direction = SDIO_DATA_TRANSFER_TO_CARD;
  sdio_data_init_struct.transfer_mode = SDIO_DATA_STREAM_TRANSFER;

  sdio_data_config(SDIOx, &sdio_data_init_struct);
  sdio_data_state_machine_enable(SDIOx, FALSE);

  response = sdio_response_get(SDIOx, SDIO_RSP1_INDEX);

  /* check card locked */
  if(response & SD_CARD_LOCKED)
  {
    return SD_LOCK_UNLOCK_ERROR;
  }
  /* send cmd11, read data */
  sdio_command_init_struct.argument =  addr;
  sdio_command_init_struct.cmd_index = SD_CMD_READ_DAT_UNTIL_STOP;
  sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
  sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;

  sdio_data_init_struct.block_size = (sdio_block_size_type)(5 << 4);
  sdio_data_init_struct.data_length = len;
  sdio_data_init_struct.timeout = SD_DATATIMEOUT ;
  sdio_data_init_struct.transfer_direction = SDIO_DATA_TRANSFER_TO_CONTROLLER;
  sdio_data_init_struct.transfer_mode = SDIO_DATA_STREAM_TRANSFER;

  stop_flag = 1;
  /* cmd12 is needed */
  return sdio_command_data_send(&sdio_command_init_struct, &sdio_data_init_struct, (uint32_t *)buf);
}

/**
  * @brief  write mmc card data stream.
  * @param  buf: data that writing to mmc card
  * @param  addr: start address mmc card
  * @param  len: data size
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type mmc_stream_write(uint8_t *buf, long long addr, uint32_t len)
{
  sd_error_status_type status = SD_OK;
  uint32_t response = 0;
  uint8_t card_state = 0;

  if(buf == NULL)
  {
    return SD_INVALID_PARAMETER;
  }

  SDIOx->dtctrl = 0x0;

  /* clear dcsm configuration */
  sdio_data_init_struct.block_size = SDIO_DATA_BLOCK_SIZE_1B;
  sdio_data_init_struct.data_length = 0;
  sdio_data_init_struct.timeout = SD_DATATIMEOUT;
  sdio_data_init_struct.transfer_direction = SDIO_DATA_TRANSFER_TO_CARD;
  sdio_data_init_struct.transfer_mode = SDIO_DATA_STREAM_TRANSFER;

  sdio_data_config(SDIOx, &sdio_data_init_struct);
  sdio_data_state_machine_enable(SDIOx, FALSE);

  response = sdio_response_get(SDIOx, SDIO_RSP1_INDEX);

  /* check card locked */
  if(response & SD_CARD_LOCKED)
  {
    return SD_LOCK_UNLOCK_ERROR;
  }
  /* send cmd20, write data */
  sdio_command_init_struct.argument = addr;
  sdio_command_init_struct.cmd_index = SD_CMD_WRITE_DAT_UNTIL_STOP;
  sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
  sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;


  sdio_data_init_struct.block_size = (sdio_block_size_type)(15 << 4);
  sdio_data_init_struct.data_length = len;
  sdio_data_init_struct.timeout = SD_DATATIMEOUT ;
  sdio_data_init_struct.transfer_direction = SDIO_DATA_TRANSFER_TO_CARD;
  sdio_data_init_struct.transfer_mode = SDIO_DATA_STREAM_TRANSFER;

  stop_flag = 1;
  /* cmd12 is needed */
  status = sdio_command_data_send(&sdio_command_init_struct, &sdio_data_init_struct, (uint32_t *)buf);

  if(status != SD_OK)
  {
    return status;
  }

  sdio_flag_clear(SDIOx, SDIO_STATIC_FLAGS);

  status = check_card_programming(&card_state);

  while((status == SD_OK) && ((card_state == SD_CARD_PROGRAMMING) || (card_state == SD_CARD_RECEIVING)))
  {
    status = check_card_programming(&card_state);
  }

  return status;
}

/**
  * @brief  sdio1 isr.
  * @param  none.
  * @retval none.
  */
void SDIO1_IRQHandler(void)
{
  sd_irq_service();
}

/**
  * @brief  sdio2 isr.
  * @param  none.
  * @retval none.
  */
void SDIO2_IRQHandler(void)
{
  sd_irq_service();
}

/**
  * @brief  allows to process all the interrupts that are high.
  * @param  none
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type sd_irq_service(void)
{
  if(sdio_flag_get(SDIOx, SDIO_DTCMPL_FLAG) != RESET)
  {
    if(stop_flag == 1)
    {
      /* send cmd12, stop transmission */
      sdio_command_init_struct.argument = 0;
      sdio_command_init_struct.cmd_index = SD_CMD_STOP_TRANSMISSION;
      sdio_command_init_struct.rsp_type = SDIO_RESPONSE_SHORT;
      sdio_command_init_struct.wait_type = SDIO_WAIT_FOR_NO;
      /* sdio command config */
      sdio_command_config(SDIOx, &sdio_command_init_struct);
      /* enable ccsm */
      sdio_command_state_machine_enable(SDIOx, TRUE);
      transfer_error = command_rsp1_error(SD_CMD_STOP_TRANSMISSION);
    }
    else
    {
      transfer_error = SD_OK;
    }
    /* clear flag */
    sdio_flag_clear(SDIOx, SDIO_DTCMPL_FLAG);
    transfer_end = 1;
    return transfer_error;
  }

  if(sdio_flag_get(SDIOx, SDIO_DTFAIL_FLAG) != RESET)
  {
    /* clear flag */
    sdio_flag_clear(SDIOx, SDIO_DTFAIL_FLAG);
    transfer_error = SD_DATA_FAIL;
    transfer_end = 1;
    return transfer_error;
  }

  if(sdio_flag_get(SDIOx, SDIO_DTTIMEOUT_FLAG) != RESET)
  {
    /* clear flag */
    sdio_flag_clear(SDIOx, SDIO_DTTIMEOUT_FLAG);
    transfer_error = SD_DATA_TIMEOUT;
    transfer_end = 1;
    return transfer_error;
  }

  if(sdio_flag_get(SDIOx, SDIO_RXERRO_FLAG) != RESET)
  {
    /* clear flag */
    sdio_flag_clear(SDIOx, SDIO_RXERRO_FLAG);
    transfer_error = SD_RX_OVERRUN;
    transfer_end = 1;
    return(SD_RX_OVERRUN);
  }

  if(sdio_flag_get(SDIOx, SDIO_TXERRU_FLAG) != RESET)
  {
    /* clear flag */
    sdio_flag_clear(SDIOx, SDIO_TXERRU_FLAG);
    transfer_error = SD_TX_UNDERRUN;
    transfer_end = 1;
    return(SD_TX_UNDERRUN);
  }

  if(sdio_flag_get(SDIOx, SDIO_SBITERR_FLAG) != RESET)
  {
    /* clear flag */
    sdio_flag_clear(SDIOx, SDIO_SBITERR_FLAG);
    transfer_error = SD_START_BIT_ERR;
    transfer_end = 1;
    return(SD_START_BIT_ERR);
  }

  /* disable interrupt */
  sdio_interrupt_enable(SDIOx, (SDIO_DTFAIL_INT  | SDIO_DTTIMEOUT_INT | \
                               SDIO_DTCMP_INT | SDIO_TXBUFH_INT | SDIO_RXBUFH_INT    | \
                               SDIO_TXERRU_INT| SDIO_RXERRO_INT | SDIO_SBITERR_INT), FALSE);
  return(SD_OK);
}

/**
  * @brief  checks for error conditions for cmd0.
  * @param  none
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type command_error(void)
{
  sd_error_status_type status = SD_OK;
  uint32_t timeout = SDIO_CMD0TIMEOUT;

  while(timeout--)
  {
    if(sdio_flag_get(SDIOx, SDIO_CMDCMPL_FLAG) != RESET)
    {
      break;
    }
  }

