IOsetting/at32f403a_407-template/Libraries/bsp/src/at32f403a_407_bsp_sdio.c
  if(timeout == 0)
  {
    return SD_CMD_RSP_TIMEOUT;
  }

  sdio_flag_clear(SDIOx, SDIO_STATIC_FLAGS);
  return status;
}

/**
  * @brief  checks for error conditions for R7 response.
  * @param  none
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type command_rsp7_error(void)
{
  sd_error_status_type status = SD_OK;
  uint32_t sts_reg = 0;
  uint32_t timeout = SDIO_CMD0TIMEOUT;

  while(timeout--)
  {
    sts_reg = SDIOx->sts;

    if(sts_reg & (SDIO_CMDFAIL_FLAG | SDIO_CMDTIMEOUT_FLAG | SDIO_CMDRSPCMPL_FLAG))
    {
      break;
    }
  }

  if((timeout == 0) || (sts_reg & SDIO_CMDTIMEOUT_FLAG))
  {
    status = SD_CMD_RSP_TIMEOUT;
    sdio_flag_clear(SDIOx, SDIO_CMDTIMEOUT_FLAG);
    return status;
  }

  if(sts_reg & SDIO_CMDRSPCMPL_FLAG)
  {
    status = SD_OK;
    sdio_flag_clear(SDIOx, SDIO_CMDRSPCMPL_FLAG);
  }

  return status;
}

/**
  * @brief  checks for error conditions for R1 response.
  * @param  cmd: the sent command index.
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type command_rsp1_error(uint8_t cmd)
{
  uint32_t sts_reg = 0;
  uint32_t rsp_cmd = 0;

  while(1)
  {
    sts_reg = SDIOx->sts;

    if(sts_reg & (SDIO_CMDFAIL_FLAG | SDIO_CMDTIMEOUT_FLAG | SDIO_CMDRSPCMPL_FLAG))
    {
      break;
    }
  }

  if(sdio_flag_get(SDIOx, SDIO_CMDTIMEOUT_FLAG) != RESET)
  {
    sdio_flag_clear(SDIOx, SDIO_CMDTIMEOUT_FLAG);
    return SD_CMD_RSP_TIMEOUT;
  }

  if(sdio_flag_get(SDIOx, SDIO_CMDFAIL_FLAG) != RESET)
  {
    sdio_flag_clear(SDIOx, SDIO_CMDFAIL_FLAG);
    return SD_CMD_FAIL;
  }

  rsp_cmd = sdio_command_response_get(SDIOx);
  if(rsp_cmd != cmd)
  {
    return SD_ILLEGAL_CMD;
  }

  sdio_flag_clear(SDIOx, SDIO_STATIC_FLAGS);

  return (sd_error_status_type)(sdio_response_get(SDIOx, SDIO_RSP1_INDEX) & SD_OCR_ERRORBITS);
}

/**
  * @brief  checks for error conditions for R3 (ocr) response.
  * @param  none
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type command_rsp3_error(void)
{
  uint32_t sts_reg = 0;;

  while(1)
  {
    sts_reg = SDIOx->sts;

    if(sts_reg & (SDIO_CMDFAIL_FLAG | SDIO_CMDTIMEOUT_FLAG | SDIO_CMDRSPCMPL_FLAG))
    {
      break;
    }
  }

  if(sdio_flag_get(SDIOx, SDIO_CMDTIMEOUT_FLAG) != RESET)
  {
    sdio_flag_clear(SDIOx, SDIO_CMDTIMEOUT_FLAG);
    return SD_CMD_RSP_TIMEOUT;
  }

  sdio_flag_clear(SDIOx, SDIO_STATIC_FLAGS);

  return SD_OK;
}

/**
  * @brief  checks for error conditions for R2 (cid or csd) response.
  * @param  none
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type command_rsp2_error(void)
{
  sd_error_status_type status = SD_OK;
  uint32_t sts_reg;
  uint32_t timeout = SDIO_CMD0TIMEOUT;

  while(timeout--)
  {
    sts_reg = SDIOx->sts;

    if(sts_reg & (SDIO_CMDFAIL_FLAG | SDIO_CMDTIMEOUT_FLAG | SDIO_CMDRSPCMPL_FLAG))
    {
      break;
    }
  }

  if((timeout == 0) || sdio_flag_get(SDIOx, SDIO_CMDTIMEOUT_FLAG) != RESET)
  {
    status = SD_CMD_RSP_TIMEOUT;
    sdio_flag_clear(SDIOx, SDIO_CMDTIMEOUT_FLAG);

    return status;
  }

  if(sdio_flag_get(SDIOx, SDIO_CMDFAIL_FLAG) != RESET)
  {
    status = SD_CMD_FAIL;
    sdio_flag_clear(SDIOx, SDIO_CMDFAIL_FLAG);
  }

  sdio_flag_clear(SDIOx, SDIO_STATIC_FLAGS);

  return status;
}

/**
  * @brief  checks for error conditions for r4 response.
  * @param  cmd: the sent command index.
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type command_rsp4_error(uint8_t cmd)
{
  uint32_t sts_reg = 0, rsp_cmd = 0;

  while(1)
  {
    sts_reg = SDIOx->sts;

    if(sts_reg & (SDIO_CMDFAIL_FLAG | SDIO_CMDTIMEOUT_FLAG | SDIO_CMDRSPCMPL_FLAG))
    {
      break;
    }
  }

  if(sdio_flag_get(SDIOx, SDIO_CMDTIMEOUT_FLAG) != RESET)
  {
    sdio_flag_clear(SDIOx, SDIO_CMDTIMEOUT_FLAG);
    return SD_CMD_RSP_TIMEOUT;
  }

  if(sdio_flag_get(SDIOx, SDIO_CMDFAIL_FLAG) != RESET)
  {
    sdio_flag_clear(SDIOx, SDIO_CMDFAIL_FLAG);

    return SD_CMD_FAIL;
  }

  rsp_cmd = sdio_command_response_get(SDIOx);
  if(rsp_cmd != cmd)
  {
    return SD_ILLEGAL_CMD;
  }

  sdio_flag_clear(SDIOx, SDIO_STATIC_FLAGS);

  return SD_OK;
}

/**
  * @brief  checks for error conditions for r5 response.
  * @param  cmd: the sent command index.
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type command_rsp5_error(uint8_t cmd)
{
  uint32_t sts_reg = 0, rsp_cmd = 0, response = 0;

  while(1)
  {
    sts_reg = SDIOx->sts;

    if(sts_reg & (SDIO_CMDFAIL_FLAG | SDIO_CMDTIMEOUT_FLAG | SDIO_CMDRSPCMPL_FLAG))
    {
      break;
    }
  }

  if(sdio_flag_get(SDIOx, SDIO_CMDTIMEOUT_FLAG) != RESET)
  {
    sdio_flag_clear(SDIOx, SDIO_CMDTIMEOUT_FLAG);

    return SD_CMD_RSP_TIMEOUT;
  }

  if(sdio_flag_get(SDIOx, SDIO_CMDFAIL_FLAG) != RESET)
  {
    sdio_flag_clear(SDIOx, SDIO_CMDFAIL_FLAG);

    return SD_CMD_FAIL;
  }

  rsp_cmd = sdio_command_response_get(SDIOx);
  if(rsp_cmd != cmd)
  {
    return SD_ILLEGAL_CMD;
  }

  sdio_flag_clear(SDIOx, SDIO_STATIC_FLAGS);

  response = sdio_response_get(SDIOx, SDIO_RSP1_INDEX);

  if(response & SD_R5_OUT_OF_RANGE)
  {
    return SD_CMD_OUT_OF_RANGE;
  }

  if(response & SD_R5_FUNCTION_NUMBER)
  {
    return SD_SDIO_UNKNOWN_FUNC;
  }

  if(response & SD_R5_ERROR)
  {
    return SD_GENERAL_UNKNOWN_ERROR;
  }

  return SD_OK;
}

/**
  * @brief  checks for error conditions for r6 (rca) response.
  * @param  cmd: the sent command index.
  * @param  prca: pointer to the variable that will contain the sd card relative
  *         address rca.
  * @retval sd_error_status_type: sd card error code.
  */
sd_error_status_type command_rsp6_error(uint8_t cmd, uint16_t *prca)
{
  sd_error_status_type status = SD_OK;
  uint32_t sts_reg, rsp_cmd = 0, response = 0;

  while(1)
  {
    sts_reg = SDIOx->sts;

    if(sts_reg & (SDIO_CMDFAIL_FLAG | SDIO_CMDTIMEOUT_FLAG | SDIO_CMDRSPCMPL_FLAG))
    {
      break;
    }
  }

  if(sdio_flag_get(SDIOx, SDIO_CMDTIMEOUT_FLAG) != RESET)
  {
    sdio_flag_clear(SDIOx, SDIO_CMDTIMEOUT_FLAG);
    return SD_CMD_RSP_TIMEOUT;
  }

  if(sdio_flag_get(SDIOx, SDIO_CMDFAIL_FLAG) != RESET)
  {
    sdio_flag_clear(SDIOx, SDIO_CMDFAIL_FLAG);
    return SD_CMD_FAIL;
  }

  rsp_cmd = sdio_command_response_get(SDIOx);
  if(rsp_cmd != cmd)
  {
    return SD_ILLEGAL_CMD;
  }

