IOsetting/at32f403a_407-template/Libraries/bsp/src/at32f403a_407_bsp_sdio.c
    /* check group 1 function support speed */
    status = sd_switch(0, 0, speed, switch_sts);

    if(status != 0)
    {
      return status;
    }

    if((switch_sts[13] & (1 << speed)) == 0)
    {
      return SD_ERROR;
    }

    status = sd_switch(1, 0, speed, switch_sts);

    if(status != 0)
    {
      return status;
    }

    /* read it back for confirmation */
    if((switch_sts[16] & 0xF) != speed)
    {
      return SD_ERROR;
    }
  }
  else if(card_type == SDIO_HIGH_SPEED_MULTIMEDIA_CARD)
  {
    status = mmc_switch(EXT_CSD_CMD_SET_NORMAL, EXT_CSD_BUS_WIDTH, (uint8_t)speed);

    if(status != 0)
    {
      return status;
    }
  }

  return status;
}

/**
  * @brief  converts the number of bytes in power of two and returns the power.
  * @param  number_of_bytes: number of bytes.
  * @retval none
  */
uint8_t convert_from_bytes_to_power_of_two(uint16_t number_of_bytes)
{
  uint8_t count = 0;

  while(number_of_bytes != 1)
  {
    number_of_bytes >>= 1;
    count++;
  }

  return count;
}

/**
  * @brief  set dma configuation for sdio
  * @param  mbuf: buffer address
  * @param  buf_size: transmission data size
  * @param  dir: dma direction, it is DMA_DIR_MEMORY_TO_PERIPHERAL(writing data)
  *              or DMA_DIR_PERIPHERAL_TO_MEMORY(read data)
  * @retval none
  */
void sd_dma_config(uint32_t *mbuf, uint32_t buf_size, dma_dir_type dir)
{
  dma_init_type dma_init_struct;
  dma_default_para_init(&dma_init_struct);

  crm_periph_clock_enable(CRM_DMA2_PERIPH_CLOCK, TRUE);

  dma_reset(DMA2_CHANNEL4);
  dma_channel_enable(DMA2_CHANNEL4, FALSE);

  dma_init_struct.peripheral_base_addr = (uint32_t)&SDIOx->buf;
  dma_init_struct.memory_base_addr = (uint32_t)mbuf;
  dma_init_struct.direction = dir;
  dma_init_struct.buffer_size = buf_size / 4;
  dma_init_struct.peripheral_inc_enable = FALSE;
  dma_init_struct.memory_inc_enable = TRUE;
  dma_init_struct.peripheral_data_width = DMA_PERIPHERAL_DATA_WIDTH_WORD;
  dma_init_struct.memory_data_width = DMA_MEMORY_DATA_WIDTH_WORD;
  dma_init_struct.loop_mode_enable = FALSE;
  dma_init_struct.priority = DMA_PRIORITY_HIGH;
  dma_init(DMA2_CHANNEL4, &dma_init_struct);

  dma_channel_enable(DMA2_CHANNEL4, TRUE);
}

/**
  * @}
  */

/**
  * @}
  */
